Repository: sailfishos-mirror/json-glib
Catalog: po/*.po
Languages: kk

source: Prettify output
kk: Шығысты әдемілеу

source: Indentation spaces
kk: Шегініс бос аралықтары

source: SPACES
kk: БОС_АРАЛЫҚТАР

source: Output file
kk: Шығыс файлы

source: FILE
kk: ФАЙЛ

source: FILE…
kk: ФАЙЛ…

source: %s: %s: error opening file: %s
kk: %s: %s: файлды ашу қатесі: %s

source: %s: %s: error parsing file: %s
kk: %s: %s: файлды талдау қатесі: %s

source: %s: %s: error writing to stdout
kk: %s: %s: stdout-қа жазу қатесі

source: %s: %s: error closing: %s
kk: %s: %s: жабу қатесі: %s

source: Format JSON files.
kk: JSON файлдарын пішімдеу.

source: json-glib-format formats JSON resources.
kk: json-glib-format JSON ресурстарын пішімдейді.

source: Error parsing commandline options: %s
kk: Командалық жол опцияларын талдау қатесі: %s

source: Try “%s --help” for more information.
kk: Қосымша ақпарат алу үшін “%s --help” көріңіз.

source: %s: missing files
kk: %s: файлдар жетіспейді

source: %s: %s: error reading file: %s
kk: %s: %s: файлды оқу қатесі: %s

source: Validate JSON files.
kk: JSON файлдарын тексеру.

source: json-glib-validate validates JSON data at the given URI.
kk: json-glib-validate берілген URI-дағы JSON деректерін тексереді.

source: Expecting a JSON object, but the root node is of type “%s”
kk: JSON объектісі күтілді, бірақ түбірлік торап түрі - “%s”

source: Unexpected type “%s” in JSON node
kk: JSON торабындағы күтпеген “%s” түрі

source: Missing elements in JSON array to conform to a tuple
kk: Кортежге сәйкес келу үшін JSON массивінде элементтер жетіспейді

source: Missing closing symbol “)” in the GVariant tuple type
kk: GVariant кортеж түріндегі жабылатын “)” таңбасы жетіспейді

source: Unexpected extra elements in JSON array
kk: JSON массивіндегі күтпеген артық элементтер

source: Invalid string value converting to GVariant
kk: GVariant түріне түрлендіру кезіндегі жарамсыз жол мәні

source: A GVariant dictionary entry expects a JSON object with exactly one member
kk: GVariant сөздік жазбасы дәл бір мүшесі бар JSON объектісін күтеді

source: GVariant class “%c” not supported
kk: GVariant “%c” класына қолдау жоқ

source: Invalid GVariant signature
kk: GVariant сигнатурасы жарамсыз

source: JSON data is empty
kk: JSON деректері бос

source: %s:%d:%d: Parse error: %s
kk: %s:%d:%d: Талдау қатесі: %s

source: JSON data must be UTF-8 encoded
kk: JSON деректері UTF-8 кодталуында болуы тиіс

source: Only one root node is allowed in a JSONPath expression
kk: JSONPath өрнегінде тек бір түбірлік торапқа рұқсат етілген

source: Root node followed by invalid character “%c”
kk: Түбірлік тораптан кейін жарамсыз “%c” таңбасы тұр

source: Missing member name or wildcard after . character
kk: . таңбасынан кейін мүше аты немесе маска көрсетілмеген

source: Malformed slice expression “%*s”
kk: “%*s” слайс өрнегі қате

source: Invalid set definition “%*s”
kk: “%*s” жиын анықтамасы жарамсыз

source: Invalid slice definition “%*s”
kk: “%*s” слайс анықтамасы жарамсыз

source: Invalid array index definition “%*s”
kk: “%*s” массив индексінің анықтамасы жарамсыз

source: Invalid first character “%c”
kk: “%c” бірінші таңбасы жарамсыз

source: The current node is of type “%s”, but an array or an object was expected.
kk: Ағымдағы торап түрі “%s”, бірақ массив немесе объект күтілген еді.

source: The index “%d” is greater than the size of the array at the current position.
kk: “%d” нұсқағышы ағымдағы позициядағы массив өлшемінен үлкен.

source: The index “%d” is greater than the size of the object at the current position.
kk: “%d” нұсқағышы ағымдағы позициядағы объект өлшемінен үлкен.

source: No node available at the current position
kk: Ағымдағы позицияда қолжетімді торап жоқ

source: The current position holds a “%s” and not an array
kk: Ағымдағы позицияда массив емес, “%s” орналасқан

source: The current node is of type “%s”, but an object was expected.
kk: Ағымдағы торап түрі “%s”, бірақ объект күтілген еді.

source: The member “%s” is not defined in the object at the current position.
kk: Ағымдағы позициядағы объектіде “%s” мүшесі анықталмаған.

source: The current position holds a “%s” and not an object
kk: Ағымдағы позицияда объект емес, “%s” орналасқан

source: The current position holds a “%s” and not a value
kk: Ағымдағы позицияда мән емес, “%s” орналасқан

source: The current position does not hold a string type
kk: Ағымдағы позицияда жол түрі жоқ
