Repository: sailfishos-mirror/json-glib
Catalog: po/kw.po
Languages: kw

source: Prettify output
kw: Teghe eskorrans

source: Indentation spaces
kw: Spassow yndentyans

source: SPACES
kw: SPASSOW

source: Output file
kw: Restren eskorrans

source: FILE
kw: RESTREN

source: FILE…
kw: RESTREN…

source: %s: %s: error opening file: %s
kw: %s: %s: error dres owth ygeri restren: %s

source: %s: %s: error parsing file: %s
kw: %s: %s: error dres ow redya restren: %s

source: %s: %s: error writing to stdout
kw: %s: %s: error dres ow skrifa dhe stdout

source: %s: %s: error closing: %s
kw: %s: %s: error ow degea: %s

source: Format JSON files.
kw: Furvasa restrennow JSON.

source: json-glib-format formats JSON resources.
kw: json-glib-format furvasa asnodhow JSON.

source: Error parsing commandline options: %s
kw: Error dres ow redya dewisyow arghadow-linen: %s

source: Try “%s --help” for more information.
kw: Assaya “%s --help” rag kedhlow moy.

source: %s: missing files
kw: %s: restrennow fyllis

source: %s: %s: error reading file: %s
kw: %s: %s: error dres ow reya restren: %s

source: Validate JSON files.
kw: Komposa restrennow JSON.

source: json-glib-validate validates JSON data at the given URI.
kw: json-glib-validate komposa data JSON orth an URI provys.

source: Expecting a JSON object, but the root node is of type “%s”
kw: Gwaytys unn tra JSON, mes an poynt gwreydhen yw a eghen “%s”

source: Unexpected type “%s” in JSON node
kw: Eghen angwaytys “%s” yn poynt JSON

source: Missing elements in JSON array to conform to a tuple
kw: Elvennow fyllis yn aray JSON rag kesfurvya dhe unn tuple

source: Missing closing symbol “)” in the GVariant tuple type
kw: Arwodh diwedh fyllis “)” y'n eghen tuple GVariant

source: Unexpected extra elements in JSON array
kw: Elvennow moy angwaytys yn aray JSON

source: Invalid string value converting to GVariant
kw: Dalgh tekst anewn dres ow treylya dhe GVariant

source: A GVariant dictionary entry expects a JSON object with exactly one member
kw: Unn enworrans gerlyver GVariant gwaytyas unn tra JSON gans unn esel poran

source: GVariant class “%c” not supported
kw: Klass GVarient “%c” anskoodhys

source: Invalid GVariant signature
kw: Sinans GVariant anewn

source: JSON data is empty
kw: Data JSON yw gwag

source: %s:%d:%d: Parse error: %s
kw: %s:%d:%d: Error redyans: %s

source: JSON data must be UTF-8 encoded
kw: Data JSON a res kodennys yn UTF-8

source: Only one root node is allowed in a JSONPath expression
kw: Unn poynt gwreydhen hepken yw gasys yn unn menegyn JSONPath

source: Root node followed by invalid character “%c”
kw: Poynt gwreydhen omsewys gans lytheren anewn “%c”

source: Missing member name or wildcard after . character
kw: Hanow esel po goodhkarten fyllis wosa lytheren “.”

source: Malformed slice expression “%*s”
kw: Menegyn tregh anewn “%*s”

source: Invalid set definition “%*s”
kw: Styryans sett anewn “%*s”

source: Invalid slice definition “%*s”
kw: Styryans tregh anewn “%*s”

source: Invalid array index definition “%*s”
kw: Styryans menegen aray anewn “%*s”

source: Invalid first character “%c”
kw: Lytheren kynsa anewn “%c”

source: The current node is of type “%s”, but an array or an object was expected.
kw: An poynt a-lemmyn yw a eghen “%s”, mes unn aray po tra yw gwaytys.

source: The index “%d” is greater than the size of the array at the current position.
kw: An menegen “%d” yw brassa es an braster a'n aray y'n le a-lemmyn.

source: The index “%d” is greater than the size of the object at the current position.
kw: An menegen “%d” yw brassa es an braster a'n tra y'n le a-lemmyn.

source: No node available at the current position
kw: Poynt kavadow vyth y'n le a-lemmyn

source: The current position holds a “%s” and not an array
kw: An le a-lemmyn synsi unn “%s” ha ny unn aray

source: The current node is of type “%s”, but an object was expected.
kw: An poynt a-lemmyn yw a eghen “%s”, mes unn tra yw gwaytys.

source: The member “%s” is not defined in the object at the current position.
kw: An esel “%s” ny styrys y'n tra y'n le a-lemmyn.

source: The current position holds a “%s” and not an object
kw: An le a-lemmyn synsi unn “%s” ha ny unn tra

source: The current position holds a “%s” and not a value
kw: An le a-lemmyn synsi unn “%s” ha ny unn niver

source: The current position does not hold a string type
kw: An le a-lemmyn ny synsi unn eghen tekst
